### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # azurerm_private_endpoint.itn_blob must be replaced
-/+ resource "azurerm_private_endpoint" "itn_blob" {
      ~ custom_dns_configs       = [] -> (known after apply)
      ~ id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-sign-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-sign-blob-pep-01" -> (known after apply)
        name                     = "io-p-itn-sign-blob-pep-01"
      ~ network_interface        = [
          - {
              - id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-sign-rg-01/providers/Microsoft.Network/networkInterfaces/io-p-itn-sign-blob-pep-01.nic.4419df2f-dace-4ac2-8906-d3205ce53541"
              - name = "io-p-itn-sign-blob-pep-01.nic.4419df2f-dace-4ac2-8906-d3205ce53541"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-sign-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-sign-blob-pep-01/privateDnsZoneGroups/private-dns-zone-group/privateDnsZoneConfigs/privatelink.blob.core.windows.net"
              - name                = "privatelink.blob.core.windows.net"
              - private_dns_zone_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net"
              - record_sets         = [
                  - {
                      - fqdn         = "iopitnsignst01.privatelink.blob.core.windows.net"
                      - ip_addresses = [
                          - "10.20.2.57",
                        ]
                      - name         = "iopitnsignst01"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      ~ resource_group_name      = "io-p-itn-sign-rg-01" -> "io-p-itn-sign-data-rg-01" # forces replacement
        tags                     = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Firma"
            "Source"         = "https://github.com/pagopa/io-sign/blob/main/infra/resources/prod"
        }
        # (2 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-sign-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-sign-blob-pep-01/privateDnsZoneGroups/private-dns-zone-group" -> (known after apply)
            name                 = "private-dns-zone-group"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                           = "io-p-itn-sign-blob-pep-01"
          ~ private_connection_resource_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-sign-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnsignst01" # forces replacement -> (known after apply) # forces replacement
          ~ private_ip_address             = "10.20.2.57" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # azurerm_private_endpoint.itn_queue must be replaced
-/+ resource "azurerm_private_endpoint" "itn_queue" {
      ~ custom_dns_configs       = [] -> (known after apply)
      ~ id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-sign-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-sign-queue-pep-01" -> (known after apply)
        name                     = "io-p-itn-sign-queue-pep-01"
      ~ network_interface        = [
          - {
              - id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-sign-rg-01/providers/Microsoft.Network/networkInterfaces/io-p-itn-sign-queue-pep-01.nic.65b92ec4-b8e5-44c9-8733-d325092fe378"
              - name = "io-p-itn-sign-queue-pep-01.nic.65b92ec4-b8e5-44c9-8733-d325092fe378"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-sign-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-sign-queue-pep-01/privateDnsZoneGroups/private-dns-zone-group/privateDnsZoneConfigs/privatelink.queue.core.windows.net"
              - name                = "privatelink.queue.core.windows.net"
              - private_dns_zone_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.queue.core.windows.net"
              - record_sets         = [
                  - {
                      - fqdn         = "iopitnsignst01.privatelink.queue.core.windows.net"
                      - ip_addresses = [
                          - "10.20.2.56",
                        ]
                      - name         = "iopitnsignst01"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      ~ resource_group_name      = "io-p-itn-sign-rg-01" -> "io-p-itn-sign-data-rg-01" # forces replacement
        tags                     = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Firma"
            "Source"         = "https://github.com/pagopa/io-sign/blob/main/infra/resources/prod"
        }
        # (2 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-sign-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-sign-queue-pep-01/privateDnsZoneGroups/private-dns-zone-group" -> (known after apply)
            name                 = "private-dns-zone-group"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                           = "io-p-itn-sign-queue-pep-01"
          ~ private_connection_resource_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-sign-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnsignst01" # forces replacement -> (known after apply) # forces replacement
          ~ private_ip_address             = "10.20.2.56" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # azurerm_storage_management_policy.io_sign_storage_itn_management_policy must be replaced
-/+ resource "azurerm_storage_management_policy" "io_sign_storage_itn_management_policy" {
      ~ id                 = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-sign-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnsignst01/managementPolicies/default" -> (known after apply)
      ~ storage_account_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-sign-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnsignst01" # forces replacement -> (known after apply) # forces replacement

      ~ rule {
            name    = "deleteafterdays"
            # (1 unchanged attribute hidden)

          ~ actions {
              ~ base_blob {
                  - auto_tier_to_hot_from_cool_enabled                             = false -> null
                    # (13 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }
    }

  # module.io_sign_storage_itn.azurerm_monitor_metric_alert.storage_account_low_availability[0] must be replaced
-/+ resource "azurerm_monitor_metric_alert" "storage_account_low_availability" {
      ~ id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-sign-rg-01/providers/Microsoft.Insights/metricAlerts/[iopitnsignst01] Low Availability" -> (known after apply)
        name                     = "[iopitnsignst01] Low Availability"
      ~ resource_group_name      = "io-p-itn-sign-rg-01" -> "io-p-itn-sign-data-rg-01" # forces replacement
      ~ scopes                   = [
          - "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-sign-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnsignst01",
        ] -> (known after apply)
        tags                     = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Firma"
            "Source"         = "https://github.com/pagopa/io-sign/blob/main/infra/resources/prod"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
        # (6 unchanged attributes hidden)

      - action {
          - action_group_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/actionGroups/ioperror" -> null
          - webhook_properties = {} -> null
        }
      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/actionGroups/ioperror"
        }

        # (1 unchanged block hidden)
    }

  # module.io_sign_storage_itn.azurerm_storage_account.this must be replaced
-/+ resource "azurerm_storage_account" "this" {
      ~ id                                 = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-sign-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnsignst01" -> (known after apply)
      ~ large_file_share_enabled           = false -> (known after apply)
        name                               = "iopitnsignst01"
      ~ primary_access_key                 = (sensitive value)
      ~ primary_blob_connection_string     = (sensitive value)
      ~ primary_blob_endpoint              = "https://iopitnsignst01.blob.core.windows.net/" -> (known after apply)
      ~ primary_blob_host                  = "iopitnsignst01.blob.core.windows.net" -> (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      ~ primary_connection_string          = (sensitive value)
      ~ primary_dfs_endpoint               = "https://iopitnsignst01.dfs.core.windows.net/" -> (known after apply)
      ~ primary_dfs_host                   = "iopitnsignst01.dfs.core.windows.net" -> (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      ~ primary_file_endpoint              = "https://iopitnsignst01.file.core.windows.net/" -> (known after apply)
      ~ primary_file_host                  = "iopitnsignst01.file.core.windows.net" -> (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      ~ primary_location                   = "italynorth" -> (known after apply)
      ~ primary_queue_endpoint             = "https://iopitnsignst01.queue.core.windows.net/" -> (known after apply)
      ~ primary_queue_host                 = "iopitnsignst01.queue.core.windows.net" -> (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      ~ primary_table_endpoint             = "https://iopitnsignst01.table.core.windows.net/" -> (known after apply)
      ~ primary_table_host                 = "iopitnsignst01.table.core.windows.net" -> (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      ~ primary_web_endpoint               = "https://iopitnsignst01.z38.web.core.windows.net/" -> (known after apply)
      ~ primary_web_host                   = "iopitnsignst01.z38.web.core.windows.net" -> (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      ~ resource_group_name                = "io-p-itn-sign-rg-01" -> "io-p-itn-sign-data-rg-01" # forces replacement
      ~ secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      ~ secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
        tags                               = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Firma"
            "Source"         = "https://github.com/pagopa/io-sign/blob/main/infra/resources/prod"
        }
        # (20 unchanged attributes hidden)

      ~ blob_properties {
          - change_feed_retention_in_days = 0 -> null
          + default_service_version       = (known after apply)
            # (3 unchanged attributes hidden)
        }

      ~ network_rules {
          ~ ip_rules                   = [] -> (known after apply)
          ~ virtual_network_subnet_ids = [] -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      - queue_properties {
          - hour_metrics {
              - enabled               = true -> null
              - include_apis          = true -> null
              - retention_policy_days = 7 -> null
              - version               = "1.0" -> null
            }
          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }
          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      - share_properties {
          - retention_policy {
              - days = 7 -> null
            }
        }
    }

Plan: 5 to add, 0 to change, 5 to destroy.

Warning: Argument is deprecated

  with module.cosmosdb_account.azurerm_cosmosdb_account.this,
  on .terraform/modules/cosmosdb_account/cosmosdb_account/main.tf line 7, in resource "azurerm_cosmosdb_account" "this":
   7:   enable_free_tier          = var.enable_free_tier

This property has been superseded by `free_tier_enabled` and will be removed
in v4.0 of the AzureRM Provider

(and 30 more similar warnings elsewhere)

Warning: Deprecated attribute

  on .terraform/modules/cosmosdb_account/cosmosdb_account/output.tf line 54, in output "connection_strings":
  54:   value     = azurerm_cosmosdb_account.this.connection_strings

The attribute "connection_strings" is deprecated. Refer to the provider
documentation for details.

(and one more similar warning elsewhere)
```

</details>
